## Import Common Package

In [3]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame(np.random.randn(5,4), index=['A','B','C','D','E'], columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.282830  1.552176 -0.952277 -1.094889
B  1.207861 -0.475223 -1.093273  2.857839
C -0.978346  0.010954  0.332705  0.285085
D  1.368360 -0.534897  0.644727  0.477769
E  0.328711 -0.960225 -0.039381 -0.097287

In [7]:
df['X']

A    1.552176
B   -0.475223
C    0.010954
D   -0.534897
E   -0.960225
Name: X, dtype: float64

In [9]:
df.X #kalau nama kolom ada spasinya tidak akan jalan

A    1.552176
B   -0.475223
C    0.010954
D   -0.534897
E   -0.960225
Name: X, dtype: float64

In [11]:
type(df['W'])

pandas.core.series.Series

In [13]:
len(df)

5

In [15]:
df[['X','Y']] # 2 kurung siku menandakan 2 kolom, kalau hanya 1 kurung siku hanya dianggap 1 kolom

          X         Y
A  1.552176 -0.952277
B -0.475223 -1.093273
C  0.010954  0.332705
D -0.534897  0.644727
E -0.960225 -0.039381

### Creating new colomn

In [18]:
df['new'] = [2,5,6,5,'joni'] # jumlah kolom baru harus sesuai dengan jumlah kolom generik
df

          W         X         Y         Z   new
A -0.282830  1.552176 -0.952277 -1.094889     2
B  1.207861 -0.475223 -1.093273  2.857839     5
C -0.978346  0.010954  0.332705  0.285085     6
D  1.368360 -0.534897  0.644727  0.477769     5
E  0.328711 -0.960225 -0.039381 -0.097287  joni

In [20]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -0.282830  1.552176 -0.952277 -1.094889 -1.235108
B  1.207861 -0.475223 -1.093273  2.857839  0.114588
C -0.978346  0.010954  0.332705  0.285085 -0.645641
D  1.368360 -0.534897  0.644727  0.477769  2.013087
E  0.328711 -0.960225 -0.039381 -0.097287  0.289330

In [23]:
df['baru'] = [i**2 for i in range(5)] # kalau mau masukkan data baru bentuknya harus list dan rownya sama)
df

          W         X         Y         Z       new  baru
A -0.282830  1.552176 -0.952277 -1.094889 -1.235108     0
B  1.207861 -0.475223 -1.093273  2.857839  0.114588     1
C -0.978346  0.010954  0.332705  0.285085 -0.645641     4
D  1.368360 -0.534897  0.644727  0.477769  2.013087     9
E  0.328711 -0.960225 -0.039381 -0.097287  0.289330    16

### Removing Column

In [25]:
df.drop('baru', axis=1) # tidak merubah data orignal

          W         X         Y         Z       new
A -0.282830  1.552176 -0.952277 -1.094889 -1.235108
B  1.207861 -0.475223 -1.093273  2.857839  0.114588
C -0.978346  0.010954  0.332705  0.285085 -0.645641
D  1.368360 -0.534897  0.644727  0.477769  2.013087
E  0.328711 -0.960225 -0.039381 -0.097287  0.289330

In [27]:
df.drop(columns='new') # tidak merubah dta original

          W         X         Y         Z  baru
A -0.282830  1.552176 -0.952277 -1.094889     0
B  1.207861 -0.475223 -1.093273  2.857839     1
C -0.978346  0.010954  0.332705  0.285085     4
D  1.368360 -0.534897  0.644727  0.477769     9
E  0.328711 -0.960225 -0.039381 -0.097287    16

In [29]:
df

          W         X         Y         Z       new  baru
A -0.282830  1.552176 -0.952277 -1.094889 -1.235108     0
B  1.207861 -0.475223 -1.093273  2.857839  0.114588     1
C -0.978346  0.010954  0.332705  0.285085 -0.645641     4
D  1.368360 -0.534897  0.644727  0.477769  2.013087     9
E  0.328711 -0.960225 -0.039381 -0.097287  0.289330    16

In [33]:
df.drop(columns='new', inplace=True) # merubah data original (error karena kehapus 2x)
df

KeyError: "['new'] not found in axis"

In [35]:
df = df.drop(columns='baru')#merubah data original jg (error karena kehapus 2 x)
df

KeyError: "['baru'] not found in axis"

In [37]:
df.drop('E', axis=0) #axis =1 untuk kolom, axis=0 untuk baris, secara default untuk bris

          W         X         Y         Z
A -0.282830  1.552176 -0.952277 -1.094889
B  1.207861 -0.475223 -1.093273  2.857839
C -0.978346  0.010954  0.332705  0.285085
D  1.368360 -0.534897  0.644727  0.477769

In [38]:
df.drop('D')

          W         X         Y         Z
A -0.282830  1.552176 -0.952277 -1.094889
B  1.207861 -0.475223 -1.093273  2.857839
C -0.978346  0.010954  0.332705  0.285085
E  0.328711 -0.960225 -0.039381 -0.097287

In [39]:
df.loc['D']

W    1.368360
X   -0.534897
Y    0.644727
Z    0.477769
Name: D, dtype: float64

In [40]:
df['W']

A   -0.282830
B    1.207861
C   -0.978346
D    1.368360
E    0.328711
Name: W, dtype: float64

In [43]:
df.iloc[1] #bedanya iloc--> menggunakan index numbering ; loc--> sesuai dgn index yang digunakan

W    1.207861
X   -0.475223
Y   -1.093273
Z    2.857839
Name: B, dtype: float64

In [46]:
df.loc['B']

W    1.207861
X   -0.475223
Y   -1.093273
Z    2.857839
Name: B, dtype: float64

In [45]:
df.loc['B']['Y']

-1.0932728913285639

In [47]:
df.loc['B','Y']

-1.0932728913285639

In [48]:
df.loc[['A','B']]

          W         X         Y         Z
A -0.282830  1.552176 -0.952277 -1.094889
B  1.207861 -0.475223 -1.093273  2.857839

In [49]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A -0.952277 -1.094889
B -1.093273  2.857839

In [50]:
df.loc[['A','B']]['X']

A    1.552176
B   -0.475223
Name: X, dtype: float64

In [51]:
df.loc[['A','B']][['X','Y']]

          X         Y
A  1.552176 -0.952277
B -0.475223 -1.093273

### Conditional Selection

In [53]:
df

          W         X         Y         Z
A -0.282830  1.552176 -0.952277 -1.094889
B  1.207861 -0.475223 -1.093273  2.857839
C -0.978346  0.010954  0.332705  0.285085
D  1.368360 -0.534897  0.644727  0.477769
E  0.328711 -0.960225 -0.039381 -0.097287

In [55]:
df>0

       W      X      Y      Z
A  False   True  False  False
B   True  False  False   True
C  False   True   True   True
D   True  False   True   True
E   True  False  False  False

In [57]:
df[df>0] #NaN = Not a Number --> yang False

          W         X         Y         Z
A       NaN  1.552176       NaN       NaN
B  1.207861       NaN       NaN  2.857839
C       NaN  0.010954  0.332705  0.285085
D  1.368360       NaN  0.644727  0.477769
E  0.328711       NaN       NaN       NaN

In [59]:
df['new'] = [2,5,6,5,'joni']
df

          W         X         Y         Z   new
A -0.282830  1.552176 -0.952277 -1.094889     2
B  1.207861 -0.475223 -1.093273  2.857839     5
C -0.978346  0.010954  0.332705  0.285085     6
D  1.368360 -0.534897  0.644727  0.477769     5
E  0.328711 -0.960225 -0.039381 -0.097287  joni

In [61]:
df > 0

TypeError: '>' not supported between instances of 'str' and 'int'

In [62]:
df = df.drop(columns='new')
df

          W         X         Y         Z
A -0.282830  1.552176 -0.952277 -1.094889
B  1.207861 -0.475223 -1.093273  2.857839
C -0.978346  0.010954  0.332705  0.285085
D  1.368360 -0.534897  0.644727  0.477769
E  0.328711 -0.960225 -0.039381 -0.097287

In [63]:
df[df['W']>0] # bukan kolom W saja yang keluar tapi seluruh COLUMN

          W         X         Y         Z
B  1.207861 -0.475223 -1.093273  2.857839
D  1.368360 -0.534897  0.644727  0.477769
E  0.328711 -0.960225 -0.039381 -0.097287

In [64]:
df[df['W']>0]['Y'] # sesuai kondisi W yang keluar!

B   -1.093273
D    0.644727
E   -0.039381
Name: Y, dtype: float64

In [65]:
df[df['W']>0] [['Y','Z']] # untuk 2 kolom gunakan 2 kurung siku

          Y         Z
B -1.093273  2.857839
D  0.644727  0.477769
E -0.039381 -0.097287

In [67]:
df[(df['W']>0) & (df['Y']>0)] #pakai AND tidak bisa

         W         X         Y         Z
D  1.36836 -0.534897  0.644727  0.477769

In [69]:
df[(df['W']>0) | (df['Y']>0)] #pakai OR tidak bisa

          W         X         Y         Z
B  1.207861 -0.475223 -1.093273  2.857839
C -0.978346  0.010954  0.332705  0.285085
D  1.368360 -0.534897  0.644727  0.477769
E  0.328711 -0.960225 -0.039381 -0.097287

In [70]:
df

          W         X         Y         Z
A -0.282830  1.552176 -0.952277 -1.094889
B  1.207861 -0.475223 -1.093273  2.857839
C -0.978346  0.010954  0.332705  0.285085
D  1.368360 -0.534897  0.644727  0.477769
E  0.328711 -0.960225 -0.039381 -0.097287

In [73]:
df = df.reset_index() #tidak merubah kalau tidak masukkan variabel

In [74]:
df

  index         W         X         Y         Z
0     A -0.282830  1.552176 -0.952277 -1.094889
1     B  1.207861 -0.475223 -1.093273  2.857839
2     C -0.978346  0.010954  0.332705  0.285085
3     D  1.368360 -0.534897  0.644727  0.477769
4     E  0.328711 -0.960225 -0.039381 -0.097287

In [75]:
ind = "CA NY WY OR CO".split(" ")
ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [89]:
df['states'] = ind
df

       index         W         X         Y         Z states
states
CA         A -0.282830  1.552176 -0.952277 -1.094889     CA
NY         B  1.207861 -0.475223 -1.093273  2.857839     NY
WY         C -0.978346  0.010954  0.332705  0.285085     WY
OR         D  1.368360 -0.534897  0.644727  0.477769     OR
CO         E  0.328711 -0.960225 -0.039381 -0.097287     CO

In [91]:
df=df.set_index('states')
df

       index         W         X         Y         Z
states
CA         A -0.282830  1.552176 -0.952277 -1.094889
NY         B  1.207861 -0.475223 -1.093273  2.857839
WY         C -0.978346  0.010954  0.332705  0.285085
OR         D  1.368360 -0.534897  0.644727  0.477769
CO         E  0.328711 -0.960225 -0.039381 -0.097287

### Multi Index Hierarchy

In [94]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
A = list(zip(outside,inside))
A

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [95]:
hier_index = pd.MultiIndex.from_tuples(A)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [97]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B'])
df

             A         B
G1 1  1.183344 -0.160604
   2 -0.538396 -1.853546
   3  0.375501 -0.298736
G2 1  1.270699  2.671647
   2 -0.548342  0.648111
   3 -1.111174  0.099773

In [98]:
df.loc['G1']

          A         B
1  1.183344 -0.160604
2 -0.538396 -1.853546
3  0.375501 -0.298736

In [100]:
df.loc['G1'].loc[1]

A    1.183344
B   -0.160604
Name: 1, dtype: float64

In [103]:
df.loc['G1']['A']

1    1.183344
2   -0.538396
3    0.375501
Name: A, dtype: float64

In [104]:
df.index.names

FrozenList([None, None])

In [106]:
df.index.names = ['grup', 'num']
df

                 A         B
grup num
G1   1    1.183344 -0.160604
     2   -0.538396 -1.853546
     3    0.375501 -0.298736
G2   1    1.270699  2.671647
     2   -0.548342  0.648111
     3   -1.111174  0.099773

In [107]:
df.xs('G1')

            A         B
num
1    1.183344 -0.160604
2   -0.538396 -1.853546
3    0.375501 -0.298736

In [108]:
df.xs(['G1',1])

A    1.183344
B   -0.160604
Name: (G1, 1), dtype: float64

In [109]:
df.xs(1,level='num') #level adalah column grup dan num

             A         B
grup
G1    1.183344 -0.160604
G2    1.270699  2.671647

### Cek Missing Value

In [111]:
df = pd.DataFrame({
    'A': [1,2,np.nan],
    'B': [5,np.nan, np.nan],
    'C': [1,2,3]
})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Dropna() method

In [112]:
df.dropna() #menghapus yang nan

     A    B  C
0  1.0  5.0  1

In [113]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [114]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [ ]:
# Feature(kolom) - Target(kolom)--> yang menentukan target (tempat aplikasi dropna)
# Target ketika ada nan wajib dihapus (dropna)

# Kolom feature, kalau jumlah nan diatas 50% tidak boleh dropna

In [116]:
df.dropna(thresh=2) #treshold utk membuat batas brp banyak nan yang di drop

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### Fillna() Method

In [117]:
df.fillna('ISI')

     A    B  C
0    1    5  1
1    2  ISI  2
2  ISI  ISI  3

In [118]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [ ]:
# Cari dataset di kaggle - story telling
# Ada kaitan dengan bisnis

# Deadline 5 Juli 2020

In [120]:
data = {
    'Company':["GOOG", "GOOG", "MSFT","MSFT","FB","FB"],
    'Person':["Sam","Charlie","Amy","Vanessa","Carl","Sarah"],
    'Sales':[200,120,255,200,500,300]
}

In [121]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    255
3    MSFT  Vanessa    200
4      FB     Carl    500
5      FB    Sarah    300

In [122]:
df.groupby('Company')

In [123]:
comp = df.groupby('Company')

In [124]:
comp.mean()

         Sales
Company
FB       400.0
GOOG     160.0
MSFT     227.5

In [126]:
comp = df.groupby('Company').mean()
comp

         Sales
Company
FB       400.0
GOOG     160.0
MSFT     227.5

In [127]:
comp = df.groupby('Company').std()
comp

              Sales
Company
FB       141.421356
GOOG      56.568542
MSFT      38.890873

In [129]:
comp = df.groupby('Company').count()
comp

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [130]:
comp = df.groupby('Company').min()
comp

          Person  Sales
Company
FB          Carl    300
GOOG     Charlie    120
MSFT         Amy    200

In [131]:
comp = df.groupby('Company').max()
comp

          Person  Sales
Company
FB         Sarah    500
GOOG         Sam    200
MSFT     Vanessa    255

In [133]:
comp = df.groupby('Company').describe().transpose()
comp

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   400.000000  160.000000  227.500000
      std    141.421356   56.568542   38.890873
      min    300.000000  120.000000  200.000000
      25%    350.000000  140.000000  213.750000
      50%    400.000000  160.000000  227.500000
      75%    450.000000  180.000000  241.250000
      max    500.000000  200.000000  255.000000

In [134]:
comp = df.groupby('Company').describe().transpose()['GOOG']
comp

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [135]:
comp = df.groupby('Company').describe().transpose()['GOOG'].loc['Sales']
comp

count      2.000000
mean     160.000000
std       56.568542
min      120.000000
25%      140.000000
50%      160.000000
75%      180.000000
max      200.000000
Name: GOOG, dtype: float64

In [136]:
comp = df.groupby('Company').describe().transpose()['GOOG'].loc['Sales'].loc['50%']
comp

160.0